In [3]:
import pandas as pd
import numpy as np

In [ ]:
student_info = {
    "name": ["amin", "ali", "reza", "amir", "mohsen", "hossein"],
    "age": [20, 23, np.nan, 22, np.nan, 19],
    "degree": ["BS", "BS", "MS", "MS", "PHD", "BS"],
    "ins": [True, False, True, False, False, False],
    "gpa": [3.5, 3.7, 3.6, 3.8, 3.9, 4]
}
student_info

{'name': ['amin', 'ali', 'reza', 'amir', 'mohsen', 'hossein'],
 'age': [20, 23, nan, 22, nan, 19],
 'degree': ['BS', 'BS', 'MS', 'MS', 'PHD', 'BS'],
 'ins': [True, False, True, False, False, False],
 'gpa': [3.5, 3.7, 3.6, 3.8, 3.9, 4]}

In [9]:
df = pd.DataFrame(student_info)
df

      name   age degree    ins  gpa
0     amin  20.0     BS   True  3.5
1      ali  23.0     BS  False  3.7
2     reza   NaN     MS   True  3.6
3     amir  22.0     MS  False  3.8
4   mohsen   NaN    PHD  False  3.9
5  hossein  19.0     BS  False  4.0

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   age     4 non-null      float64
 2   degree  6 non-null      object
 3   ins     6 non-null      bool
 4   gpa     6 non-null      float64
dtypes: bool(1), float64(2), object(2)
memory usage: 330.0+ bytes

In [12]:
df.head(2)

   name   age degree    ins  gpa
0  amin  20.0     BS   True  3.5
1   ali  23.0     BS  False  3.7

In [14]:
df.tail(3)

      name   age degree    ins  gpa
3     amir  22.0     MS  False  3.8
4   mohsen   NaN    PHD  False  3.9
5  hossein  19.0     BS  False  4.0

In [18]:
df.loc[[1, 2]]

   name   age degree    ins  gpa
1   ali  23.0     BS  False  3.7
2  reza   NaN     MS   True  3.6

In [20]:
s = pd.Series([1, 2, 3, 4, 5]).index("a")
s

TypeError: 'RangeIndex' object is not callable

In [24]:
cities = ['Kolkata', 'Chicago', 'Toronto', 'Lisbon']
populations = [14.85, 2.71, 2.93, 0.51]
city_series = pd.Series(populations, index=cities)
city_series
# city_series.index
# Index(['Kolkata', 'Chicago', 'Toronto', 'Lisbon'], dtype='object')

Kolkata    14.85
Chicago     2.71
Toronto     2.93
Lisbon      0.51
dtype: float64